<?

$bbin_root_url = "http://nerch.026986.com/"; // API服务域名
$bbinSxInit['data_api_md5_key'] = 'A48FAA7425874854967F60FECD1303BC'; //BBIN视讯明码 MD5
$language = "zh-cn"; // 目前全額提供 zh-cn ,en 多數已支援

$bbin_agent = 'nerch';
$bb_member_ext_ref = substr($bbin_agent , -2); // 渠道标识（2-50）

//--------------------------------渠道代理号Start
$platform_owner_id = 'dev';    //平台
$bbin_prefix =   $bb_member_ext_ref . $platform_owner_id; // 会员平台前缀
//---------------------------------渠道代理号End

// 游戏大厅
$bbinGamePresents = ['live'=>'视讯', 'ball'=>'体育', 'game'=>'电子', 'Ltlottery'=>'彩票', 'fisharea'=>'捕鱼' ];
//	要进入的大厅 live 视讯 ball 体育 game 电子 Ltlottery 彩票 fisharea 捕鱼
$bbinGamePresentLive = 'live';

// 拉取注单区分
$betGameType = [
    'money' => '真人额度转换记录',
    'bet' => '真人视讯记录',      //真人下注记录 视讯直播(BB视讯)
    'bet_sport' => '体育赛事记录',    //体育下注记录 体育赛事(BB体育)
    'bet_slots' => '电子游艺记录',    //电子游艺注单 电子游艺(捕鱼机  BB电子)
    'bet_lottery' => '彩票游戏注单记录',    //彩票注单 彩票游戏(BB彩票)
    'bet_3d' => '3D彩票记录',   //3D彩票
];

// 根据bbin游戏注单type 获取大类 Kind
$bbinGameTypeKind = ['bet_sport'=>'1', 'bet'=>'3', 'bet_slots'=>'5', 'bet_lottery'=>'12', ];

// BBIN游戏分类
$bbinGameKind = [
    '1'=>'BB体育',
    '3'=>'BB视讯',
    '5'=>'BB电子',
    '12'=>'BB彩票',
    '30'=>'BB捕鱼达人',
    '38'=>'BB捕鱼大师',
    //'66'=>'BB棋牌',
];

// GameType 列表
$bbGameCateType = [
    //  BB体育 (GameKind: 1)
    '1' => [
        'FT' => '足球',
        'BK' => '蓝球',
        'FB' => '美式足球',
        'IH' => '冰球',
        'BS' => '棒球',
        'TN' => '网球',
        'F1' => '其他',
        'SP' => '冠军赛',
        'CB' => '混合过关',
    ],

    // BB视讯 $bbBets (GameKind: 3)
    '3' => [
        '3001' => '百家乐',
        '3003' => '龙虎斗',
        '3005' => '三公',
        '3006' => '温州牌九',
        '3007' => '轮盘',
        '3008' => '骰宝',
        '3010' => '德州扑克',
        '3011' => '色碟',
        '3012' => '牛牛',
        '3014' => '无限21点',
        '3015' => '番摊',
        '3016' => '鱼虾蟹',
        '3017' => '保险百家乐',
        '3018' => '炸金花',
        '3019' => '幸运转轮',
        '3020' => '走地百家乐',
        '3021' => 'HiLo',
    ],

    // BB电子 (GameKind: 5)
    '5' => [
        '5026' => '2012伦敦奥运',
        '5045' => '森林舞会',
        '5046' => '斗魂',
        '5096' => '五行',
        '5097' => '海底世界',
        '5098' => '五福临门',
        '5099' => '金狗旺岁',
        '5100' => '七夕',
        '5110' => '夜上海',
        '5119' => '神秘岛',
        '5120' => '女娲补天',
        '5121' => '奥林帕斯',
        '5122' => '球球大作战',
        '5127' => '绝地求生',
        '5128' => '多福多财',
        '5138' => '夹猪珠',
        '5139' => '熊猫乐园',
        '5140' => '啤酒嘉年华',
        '5141' => '斗牛赢家',
        '5142' => '魔光幻音',
        '5143' => '糖果派对3',
        '5144' => '情人夜',
        '5146' => '糖果派',
        '5147' => '财富选择',
        '5148' => '财富滚滚',
        '5149' => '财富满堂',
        '5839' => '经典高球',
        '5901' => '连环夺宝',
        '5902' => '糖果派对',
        '5908' => '糖果派对2',
        '5909' => '开心消消乐',
        '5910' => '魔法元素',
        '5912' => '连环夺宝2',
        '5888' => 'JACKPOT',
    ],

    // BB彩票 $bblotterys  (GameKind: 12)
    '12' => [
        'LT'=>'六合彩',
        'BBQL'=>'BB 竞速六合彩',
        'BBLT'=>'BB 六合彩',
        'B128'=>'BB 幸运28',
        'BBRB'=>'BB 滚球王',
        'BQ3D'=>'BB 竞速3D',
        'BB3D'=>'BB3D',
        'BJ3D'=>'3D彩',
        'PL3D'=>'排列三',
        'SH3D'=>'上海时时乐',
        'BBFT'=>'BB 番摊',
        'BBPT'=>'BB 深海派对',
        'BBHL'=>'BB 高低',
        'BBAD'=>'BB 双喜龙门',
        'BBGE'=>'BB 淘金蛋',
        'LDDR'=>'梯子游戏',
        'LDRS'=>'经典梯子',
        'BBLM'=>'BB 射龙门',
        'LKPA'=>'BB 幸运熊猫',
        'BCRA'=>'BB 百家彩票-A',
        'BCRB'=>'BB 百家彩票-B',
        'BCRC'=>'BB 百家彩票-C',
        'BCRD'=>'BB 百家彩票-D',
        'BCRE'=>'BB 百家彩票-E',
        'BCR1'=>'BB 百家彩票-TB1',
        'BCR2'=>'BB 百家彩票-TB2',
        'B1PK'=>'BB 北京PK拾',
        'BJPK'=>'北京PK拾',
        'BBPK'=>'BB PK3',
        'RDPK'=>'BB 雷电PK',
        'B1E5'=>'BB 11选5',
        'GDE5'=>'广东11选5',
        'JXE5'=>'江西11选5',
        'SDE5'=>'山东十一运夺金',
        'B1SC'=>'BB 重庆时时彩',
        'CQSC'=>'重庆时时彩',
        'XJSC'=>'新疆时时彩',
        'TJSC'=>'天津时时彩',
        'B1Q3'=>'BB 快3',
        'JSQ3'=>'江苏快3',
        'BBQK'=>'BB 竞速快乐彩',
        'BJKN'=>'北京快乐8',
        'B1SF'=>'BB 十分彩',
        'TJSF'=>'天津十分彩',
        'GXSF'=>'广西十分彩',
        'CQWC'=>'重庆百变王牌',
        'CQSF'=>'重庆幸运农场',
        'LK28'=>'幸运28',
        'HPSC'=>'欢乐生肖',
        'OTHER'=>'全部BB彩票 (不包含六合彩)',
    ],

    // BB捕鱼达人 (GameKind: 30)
    '30' => [
       '30598' => '捕鱼达人2',
       '30599' => '捕鱼达人',
    ],

    // BB捕鱼大师 (GameKind: 38)
    '38' => [
        '38001' => '捕鱼大师',
    ],

    // BB棋牌 (GameKind: 66)
    '66' => [
        '66001'=>'炸金花',
        '66002'=>'二八杠',
        '66003'=>'通比牛牛',
        '66004'=>'抢庄牛牛',
        '66005'=>'大话骰',
    ],
];

// 行动装置
$Origins = [
    'M' => '行动装置下单',
    'MI1' => 'ios手机',
    'MI2' => 'ios平板',
    'MA1' => 'Android手机',
    'MA2' => 'Android平板',
    'P' => 'PC下单',
];

// 输赢结果
$ogWinLoseResult = array(
    '1'=>'输',
    '2'=>'赢',
    '3'=>'和',
    '4'=>'无效',
    '5'=>'未结算',
);


// 牌的点数 J Q K，牌的显示
/*$aCardsPoint = array(
    1=>'A',
    2=>'2',
    3=>'3',
    4=>'4',
    5=>'4',
    6=>'6',
    7=>'7',
    8=>'8',
    9=>'9',
    10=>'10',
    11=>'J',
    12=>'Q',
    13=>'K',
);*/
// 牌的花色(1方,2梅,3红,4黑桃)
/*$aCardsColor = array(
    1=>'方',
    2=>'梅',
    3=>'红',
    4=>'黑',
);*/

//--------------------------------------------------------------下注区域Start

//--------------------------------------------------------------下注区域End
