<?php

//商户信息 测试
$klqp_merchant['merchantId'] = '1011';          //商户ID
$klqp_merchant['merchantname'] = 'hgtest';      //商户标识
$klqp_merchant['entity_key'] = "hgtesthgtesthgtesthgtesthgtest";  //加密key


$kl_root_url = "http://merchant.qqq7557.com/index.jsp"; //测试
//$kl_root_url = "http://merchant.365klqp.com/index.jsp"; //生产

$klqp_owner_id = $klqp_merchant['merchantname']; // 平台标识（2-50）
$klqp_prefix =  $klqp_owner_id.'_';     // 平台前缀


$hallGameId = 100;  // 游戏大厅
$pcUrl = 'http://www.qqq7557.com/';    // PC
$wapUrl = 'http://wapgame.qqq7557.com';   //WAP
//$pcUrl = 'http://www.365klqp.com/';    // 生产
//$wapUrl = 'http://wapgame.365klqp.com';   //生产


// 是否撤单
$cancel_status = [
    '0' => '未撤单',
    '1' => '用户撤单',
    '4' => '未开撤单',
    '9' => '管理员撤单',
];

// 来自
$frms = [
    '1' => '网页',
    '2' => '客户端',
    '3' => 'WAP',
    '4' => '安卓APP',
    '5' => '苹果APP',
];

$klGameType = [
    '101' => '百家乐',
    '102' => '幸运大转盘',
    '103' => '龙虎',
    '104' => '极速骰宝',
    '105' => '俄罗斯轮盘',
    '106' => '西施早餐',
    '107' => '二十一点',
    '108' => '赢三张',
    '109' => '水果机',
    '110' => '百人牛牛',
    '111' => '多人百家乐',
    '112' => '多人龙虎',
    '113' => '趣味牛牛',
    '114' => '江苏骰宝',
    '115' => '德州扑克',
    '116' => '三国水果机',
    '117' => '三公',
    '118' => '神奇弹珠',
    '119' => '加勒比扑克',
    '120' => '打鼹鼠',
    '121' => 'Super7百家乐',
    '122' => '大富翁',
    '123' => '石头剪刀布',
    '124' => '超级龙虎斗',
    '125' => '奔驰宝马',
    '126' => '百人三公',
    '127' => '足球世界杯',
    '128' => '四大美女',
    '129' => '二八杠',
    '130' => '森林舞会',
    '131' => '明星水果机',
    '132' => '球星水果机',
    '133' => '龙虎斗（重庆时时彩）',
    '134' => '龙虎斗（腾讯分分彩）',
    '135' => '捉高低',
    '136' => 'Pontoon 21点',
    '137' => '牌九扑克',
    '138' => '标准水果机',
    '139' => '葫芦娃转盘',
    '140' => '财神转盘',
    '142' => '雪豹水果机',
    '143' => '新龙虎',
    '144' => '新超级龙虎',
    '145' => '新百家乐',
    '146' => '新超级百家乐',
    '201' => '斗地主',
    '202' => '扎金花',
    '203' => '跑得快',
    '204' => '德州扑克（对战类）',
    '205' => '二人麻将',
];
 
?>