<?php
session_start();

// 旧版是否启用生成静态页面模板
if(!defined("CREAT_STATIC_PAGES")) { // TRUE生成 FALSE
    define("CREAT_STATIC_PAGES", TRUE);
}

//刷水中心推送比赛开关 - 此配置仅仅配置在刷水中心服务器
if(!defined("DATA_CENTER_SWITCH")) {
    define("DATA_CENTER_SWITCH", FALSE);
}

//获取刷水中心水源的平台 - 此配置仅仅配置在刷水中心服务器
if(!defined("DATA_CENTER_CHILDREN")) {
    define("DATA_CENTER_CHILDREN", '');
}

//获取刷水中心水源的平台标志 - 此配置用于获取平台
if(!defined("DATA_CENTER_PREFIX")) {
    define("DATA_CENTER_PREFIX", 'HGCS');
}

// js，css添加版本号
if(!defined("AUTOVER")) {
    define("AUTOVER", '20200483');
}

// 模板名称，0086 6668 3366 suncity jinsha wnsr  newhg  8msport 0086dj bet365 nbet365
if(!defined("TPL_FILE_NAME")) {
    define("TPL_FILE_NAME", 'bet365');
}

// 模板名称，0086 6668 3366 suncity jinsha wnsr  newhg  8msport 0086dj bet365 nbet365
if(!defined("TPL_NAME")) {
    define("TPL_NAME", 'views/'.TPL_FILE_NAME.'/');
}

// 模板集合,校验使用
if(!defined("TPL_FILE_NAMES")) {
    define("TPL_FILE_NAMES", ['0086','0086dj','6668','bet365','nbet365']);
}

// 平台的公司名称，网页头部显示用（HG0086集团，HG6668集团，太阳城集团，金沙集团，HG3366集团）
if(!defined("COMPANY_NAME")) {
    define("COMPANY_NAME", 'HG0086集团');
}

// 优惠图片上传
if(!defined("PROMOS_PIC_DOMAIN")) {
    define("PROMOS_PIC_DOMAIN", 'http://tpym11112222.com');
}

// AG避开白名单的线路开关 TRUE 走配置线路， FALSE 走默认线路
if(!defined("AG_TRANSFER_SWITCH")) {
    define("AG_TRANSFER_SWITCH", TRUE);
}

// AG前台的业务全部走此域名
if(!defined("AG_TRANSFER_URL")) {
    define("AG_TRANSFER_URL", 'http://agip0000.com');
}

// AG数据中心开关 TRUE 数据中心， FALSE 走默认线路
if(!defined("AG_DATA_CENTER_SWITCH")) {
    define("AG_DATA_CENTER_SWITCH", TRUE);
}

// AG数据中心域名
if(!defined("AG_DATA_CENTER_URL")) {
    define("AG_DATA_CENTER_URL", 'http://gg.zrsx88.com');
}

// 导入过来的彩票平台老用户名是否增加代理前缀，TRUE 需要前缀，FALSE 不需要前缀
if(!defined("USERNAME_NEED_CP_AGENT_PREFIX")) {
    define("USERNAME_NEED_CP_AGENT_PREFIX", FALSE);
}

// 导入创富彩票老会员，已经有相同的用户名的导入是否有添加前缀（方便登录时彩票格式密码校验登录）
if(!defined("SAME_USERNAME_ADD_PREFIX")) {
    define("SAME_USERNAME_ADD_PREFIX", FALSE);
}

// 导入创富彩票老会员重名的会员前缀
if(!defined("SAME_USERNAME_PREFIX")) {
    define("SAME_USERNAME_PREFIX", 'cf_');
}

//试玩参观填写手机号的开关。TRUE 需要输入，FALSE 无需输入
if(!defined("GUEST_LOGIN_MUST_INPUT_PHONE")) {
    define("GUEST_LOGIN_MUST_INPUT_PHONE", TRUE);
}

//赔率纠正开关
if(!defined("ODDS_REPAIR_SWITCH")) {
    define("ODDS_REPAIR_SWITCH", 1);
}

//刷水路径定义
if(!defined("ADMIN_CLI_URL")) {
    define("ADMIN_CLI_URL", dirname(dirname(__FILE__)).'/agents/_cli/');
}

//登录加密串
if(!defined("LOGIN_ENCRYPTIONCODE")) {
    define("LOGIN_ENCRYPTIONCODE", "DX70887");
}

//验证管理员IP开关
if(!defined("CHECK_IP_SWITCH")) {
    define("CHECK_IP_SWITCH", FALSE);
}

//后台登录验证码开关
if(!defined("CHECK_CODE_SWITCH")) {
    define("CHECK_CODE_SWITCH", FALSE);
}

//admin.xhg518.cn后台管理员登录白名单IP
if(!defined("ADMIN_LIST_IP")) {
    define("ADMIN_LIST_IP", "192.168.1.7,192.168.1.26,192.168.1.80,119.95.45.217");
}

// 后台某子账号权限限制
if(!defined('ADMIN_SUB_USER')) {
    define("ADMIN_SUB_USER", "admin668");
}

//Google身份标识
if(!defined("Identification")) {
    define("Identification", "admin.xhg518.cn");
}

//定义后台管理员登录标签
if(!defined("ADMINLOGINFLAG")) {
    define("ADMINLOGINFLAG", "iamroot");
}

//Google安全密匙SecretKey
if(!defined("SecretKey")) {
    define("SecretKey", "VXGHRNSSTVJTAVWB");
}

if(!defined("RUNNING_STATIC_SERVER")) {
    define("RUNNING_STATIC_SERVER", "http://www.huangguan.lloc");
}

if(!defined("TODAYFUTURE_STATIC_SERVER")) {
    define("TODAYFUTURE_STATIC_SERVER", "http://www.huangguan.lloc");
}

//SQL 防止安全注入开关
if(!defined("SAFE_INJECTION")) {
    define("SAFE_INJECTION", TRUE);
}


// 定义前端轮播图缓存时间，60 分钟
if(!defined("BANNERCACHETIME")) {
    define("BANNERCACHETIME", '60');
}

// 确定交易投注生成图片开关
if(!defined("GENERATE_IMA_SWITCH")) {
    define("GENERATE_IMA_SWITCH", TRUE);
}

// 存取款快速充值开关
if(!defined("DEPOSIT_WITHDRAW_SWITCH")) {
    define("DEPOSIT_WITHDRAW_SWITCH", TRUE);
}

// 前台活动展示开关
if(!defined("ACTIVITY_SWITCH")) {
    define("ACTIVITY_SWITCH", TRUE);
}

// 全局定义盘口，默认香港盘 H
if(!defined("GAME_POSITION")) {
    define("GAME_POSITION", 'H');
}

//公司的测试代理线
if(!defined("TEST_AGENT")) {
    define("TEST_AGENT", "ceshi000");
}

//  根据会员注册时间享受公司存款优惠
if(!defined("COMPANY_DEPOSIT_TIME")){
    define("COMPANY_DEPOSIT_TIME", "2020-08-01");
}

//小于等于多少金额可以允许自动出款
if(!defined("AUTO_WITHDRAW_MAX_MONEY")) {
    define("AUTO_WITHDRAW_MAX_MONEY", '5000');
}

// 真实姓名不重复限制开关 TRUE 不允许重复 FALSE 允许重复
if(!defined("ALIAS_ALLOWS_DUPLICATE")) {
    define("ALIAS_ALLOWS_DUPLICATE", FALSE);
}

// 196数据刷水网址
if(!defined('FLUSH_WEBSITE_196')) {
    define('FLUSH_WEBSITE_196', 'https://www.ujiule.net');
}

//默认定义超全局变量里的参数
function _request($str){
    $val = !empty($_REQUEST[$str]) ? $_REQUEST[$str] : null;
    return $val;
}

//滚球静态页面服务器域名
if(!defined("RUNNING_STATIC_SERVER")) {
    define("RUNNING_STATIC_SERVER", "http://gci.6668ag.com:81");
}

if(!defined("TODAYFUTURE_STATIC_SERVER")) {
    define("TODAYFUTURE_STATIC_SERVER", "http://gci.6668ag.com:81");
}

// 固定配置前端域名
$ulrarr ='836298.com';

//配置任意一个广告站域名
$registeredAgent="http://ad.huangguan.lcn";


function getMainHostThis() {
    $host = $_SERVER["HTTP_HOST"];
    $hostArray = explode('.', $host);
    $count = count($hostArray);
    switch ($count)
    {
        case 4 :
        case 3 :
            unset($hostArray[0]);
            $mainhost = implode(".", $hostArray);
            break;
        case 2 :
            $mainhost = implode(".", $hostArray);
            break;
        case 1 :
            $mainhost = false;
            break;
    }
    return $mainhost;
}

// 原生应用key
if(!defined("APP_KEY")) {
    define("APP_KEY", "SgVXx6Kyy4WpiQ3dbUgjzzrBSP8HylqPjeZfL7BJVprTJrRG6goRCw5lBu1g61vv");
}

//汇通自动出款更新状态的域名（中间站域名）
$ht_auto_pay_back_url = 'http://pay1.pay6668a.com';

// 第三方充值
$thirdpay_code=array('bf'=>'宝付','ddb'=>'多得宝','hfb'=>'汇付宝','lfu'=>'lfu','mb'=>'摩宝','mby'=>'魔宝云','mf'=>'秒付','rh'=>'融合','rx'=>'仁信','sf'=>'闪付','syx'=>'商银信','wfu'=>'w付','xfu'=>'星付','xh'=>'信汇','yb'=>'易宝','yyh'=>'易云汇','zf'=>'智付','zhf'=>'智汇付','fkt'=>'福卡通','sft'=>'顺付通','db'=>'得宝',);

//--------------------------------------------------- 彩票 Start 20180529
//快3
$config['k3_typecode']=array(
    //猜必出
    1500=>array(161,"1"),
    1501=>array(161,"2"),
    1502=>array(161,"3"),
    1503=>array(161,"4"),
    1504=>array(161,"5"),
    1505=>array(161,"6"),

    //三同号
    1509=>array(164,"1、1、1"),
    1510=>array(164,"2、2、2"),
    1511=>array(164,"3、3、3"),
    1512=>array(164,"4、4、4"),
    1513=>array(164,"5、5、5"),
    1514=>array(164,"6、6、6"),

    //和值
    1611=>array(165,"3点"),
    1515=>array(165,"4点"),
    1516=>array(165,"5点"),
    1517=>array(165,"6点"),
    1518=>array(165,"7点"),
    1519=>array(165,"8点"),
    1520=>array(165,"9点"),
    1521=>array(165,"10点"),
    1522=>array(165,"11点"),
    1523=>array(165,"12点"),
    1524=>array(165,"13点"),
    1525=>array(165,"14点"),
    1526=>array(165,"15点"),
    1527=>array(165,"16点"),
    1528=>array(165,"17点"),
    1612=>array(165,"18点"),

    //二不同号
    1529=>array(166,"1、2"),
    1530=>array(166,"1、3"),
    1531=>array(166,"1、4"),
    1532=>array(166,"1、5"),
    1533=>array(166,"1、6"),
    1534=>array(166,"2、3"),
    1535=>array(166,"2、4"),
    1536=>array(166,"2、5"),
    1537=>array(166,"2、6"),
    1538=>array(166,"3、4"),
    1539=>array(166,"3、5"),
    1540=>array(166,"3、6"),
    1541=>array(166,"4、5"),
    1542=>array(166,"4、6"),
    1543=>array(166,"5、6"),

    //二同号复选
    1544=>array(167,"1、1"),
    1545=>array(167,"2、2"),
    1546=>array(167,"3、3"),
    1547=>array(167,"4、4"),
    1548=>array(167,"5、5"),
    1549=>array(167,"6、6"),

    //猜必不出
    1550=>array(378,"1"),
    1551=>array(378,"2"),
    1552=>array(378,"3"),
    1553=>array(378,"4"),
    1554=>array(378,"5"),
    1555=>array(378,"6"),

    //大小单双
    1506=>array(162,"大"),//大
    1507=>array(162,"小"),//小
    1556=>array(162,"单"),//单
    1557=>array(162,"双"),//双

    //通选
    1508=>array(163,"豹子"),
    1558=>array(381,"顺子"),
    1559=>array(382,"对子"),
    1560=>array(383,"三不同"),

    //三不同
    1561=>array(379,"1、2、3"),
    1562=>array(379,"1、2、4"),
    1563=>array(379,"1、2、5"),
    1564=>array(379,"1、2、6"),
    1565=>array(379,"1、3、4"),
    1566=>array(379,"1、3、5"),
    1567=>array(379,"1、3、6"),
    1568=>array(379,"1、4、5"),
    1569=>array(379,"1、4、6"),
    1570=>array(379,"1、5、6"),
    1571=>array(379,"2、3、4"),
    1572=>array(379,"2、3、5"),
    1573=>array(379,"2、3、6"),
    1574=>array(379,"2、4、5"),
    1575=>array(379,"2、4、6"),
    1576=>array(379,"2、5、6"),
    1577=>array(379,"3、4、5"),
    1578=>array(379,"3、4、6"),
    1579=>array(379,"3、5、6"),
    1580=>array(379,"4、5、6"),

    //二同号单选
    1581=>array(380,"1、1、2"),
    1582=>array(380,"1、1、3"),
    1583=>array(380,"1、1、4"),
    1584=>array(380,"1、1、5"),
    1585=>array(380,"1、1、6"),
    1586=>array(380,"2、2、1"),
    1587=>array(380,"2、2、3"),
    1588=>array(380,"2、2、4"),
    1589=>array(380,"2、2、5"),
    1590=>array(380,"2、2、6"),
    1591=>array(380,"3、3、1"),
    1592=>array(380,"3、3、2"),
    1593=>array(380,"3、3、4"),
    1594=>array(380,"3、3、5"),
    1595=>array(380,"3、3、6"),
    1596=>array(380,"4、4、1"),
    1597=>array(380,"4、4、2"),
    1598=>array(380,"4、4、3"),
    1599=>array(380,"4、4、5"),
    1600=>array(380,"4、4、6"),
    1601=>array(380,"5、5、1"),
    1602=>array(380,"5、5、2"),
    1603=>array(380,"5、5、3"),
    1604=>array(380,"5、5、4"),
    1605=>array(380,"5、5、6"),
    1606=>array(380,"6、6、1"),
    1607=>array(380,"6、6、2"),
    1608=>array(380,"6、6、3"),
    1609=>array(380,"6、6、4"),
    1610=>array(380,"6、6、5"),
);

$config ['ssc_typecode'] = array (
    1000 => array (5,"第一球"),
    1001 => array (6,"第二球"),
    1002 => array (7,"第三球"),
    1003 => array (8,"第四球"),
    1004 => array (9,"第五球"),
    1005 => array (10,"1-5大小","大"), // 大
    1006 => array (10,"1-5大小","小 "), // 小
    1007 => array (11,"1-5單雙","單"), // 单
    1008 => array (11,"1-5單雙","雙"), // 双
    1009 => array (12,"總和大小","總和大"), // 總大
    1010 => array (12,"總和大小","總和小"), // 總小
    1011 => array (13,"總和單雙","總和單"), // 總單
    1012 => array (13,"總和單雙","總和雙"), // 總雙
    1013 => array (14,"龍虎和","龍"), // 龍
    1014 => array (14,"龍虎和","虎"), // 虎
    1015 => array (14,"龍虎和","和"), // 和
    1016 => array (15,"前三","豹子"), // 豹子
    1017 => array (15,"前三","順子"), // 順子
    1018 => array (15,"前三","對子"), // 對子
    1019 => array (15,"前三","半顺"), // 半顺
    1020 => array (15,"前三","雜六"), // 雜六
    1021 => array (16,"中三","豹子"), // 豹子
    1022 => array (16,"中三","順子"), // 順子
    1023 => array (16,"中三","對子"), // 對子
    1024 => array (16,"中三","半顺"), // 半顺
    1025 => array (16,"中三","雜六"), // 雜六
    1026 => array (17,"後三","豹子"), // 豹子
    1027 => array (17,"後三","順子"), // 順子
    1028 => array (17,"後三","對子"), // 對子
    1029 => array (17,"後三","半顺"), // 半顺
    1030 => array (17,"後三","雜六")  // 雜六
);

//极速时时彩
$config['jsSSC_typecode']=array(
    1100=>array(209,"第一球"),
    1101=>array(210,"第二球"),
    1102=>array(211,"第三球"),
    1103=>array(212,"第四球"),
    1104=>array(213,"第五球"),

    1105=>array(214,"1-5大小","大"),//大
    1106=>array(214,"1-5大小","小 "),//小

    1107=>array(215,"1-5单双","单"),//单
    1108=>array(215,"1-5单双","双"),//双

    1109=>array(216,"总和大小","总和大"),//總大
    1110=>array(216,"总和大小","总和小"),//總小

    1111=>array(217,"总和单双","总和单"),//總單
    1112=>array(217,"总和单双","总和双"),//總雙

    1113=>array(218,"龙虎和","龙"),//龙
    1114=>array(218,"龙虎和","虎"),//虎
    1115=>array(218,"龙虎和","和"),//和

    1116=>array(219,"前三","豹子"),//豹子
    1117=>array(219,"前三","顺子"),//顺子
    1118=>array(219,"前三","对子"),//对子
    1119=>array(219,"前三","半顺"),//半顺
    1120=>array(219,"前三","杂六"),//杂六

    1121=>array(220,"中三","豹子"),//豹子
    1122=>array(220,"中三","顺子"),//顺子
    1123=>array(220,"中三","对子"),//对子
    1124=>array(220,"中三","半顺"),//半顺
    1125=>array(220,"中三","杂六"),//杂六

    1126=>array(221,"后三","豹子"),//豹子
    1127=>array(221,"后三","顺子"),//顺子
    1128=>array(221,"后三","对子"),//对子
    1129=>array(221,"后三","半顺"),//半顺
    1130=>array(221,"后三","杂六"),//杂六
);
// 三分彩
$config['sfcSSC_typecode']=array(
    1200=>array(409,"第一球"),
    1201=>array(410,"第二球"),
    1202=>array(411,"第三球"),
    1203=>array(412,"第四球"),
    1204=>array(413,"第五球"),

    1205=>array(414,"1-5大小","大"),//大
    1206=>array(414,"1-5大小","小 "),//小

    1207=>array(415,"1-5单双","单"),//单
    1208=>array(415,"1-5单双","双"),//双

    1209=>array(416,"总和大小","总和大"),//總大
    1210=>array(416,"总和大小","总和小"),//總小

    1211=>array(417,"总和单双","总和单"),//總單
    1212=>array(417,"总和单双","总和双"),//總雙

    1213=>array(418,"龙虎和","龙"),//龙
    1214=>array(418,"龙虎和","虎"),//虎
    1215=>array(418,"龙虎和","和"),//和

    1216=>array(419,"前三","豹子"),//豹子
    1217=>array(419,"前三","顺子"),//顺子
    1218=>array(419,"前三","对子"),//对子
    1219=>array(419,"前三","半顺"),//半顺
    1220=>array(419,"前三","杂六"),//杂六

    1221=>array(420,"中三","豹子"),//豹子
    1222=>array(420,"中三","顺子"),//顺子
    1223=>array(420,"中三","对子"),//对子
    1224=>array(420,"中三","半顺"),//半顺
    1225=>array(420,"中三","杂六"),//杂六

    1226=>array(421,"后三","豹子"),//豹子
    1227=>array(421,"后三","顺子"),//顺子
    1228=>array(421,"后三","对子"),//对子
    1229=>array(421,"后三","半顺"),//半顺
    1230=>array(421,"后三","杂六"),//杂六
);

// 五分彩
$config['wfcSSC_typecode']=array(
    1300=>array(509,"第一球"),
    1301=>array(510,"第二球"),
    1302=>array(511,"第三球"),
    1303=>array(512,"第四球"),
    1304=>array(513,"第五球"),

    1305=>array(514,"1-5大小","大"),//大
    1306=>array(514,"1-5大小","小 "),//小

    1307=>array(515,"1-5单双","单"),//单
    1308=>array(515,"1-5单双","双"),//双

    1309=>array(516,"总和大小","总和大"),//總大
    1310=>array(516,"总和大小","总和小"),//總小

    1311=>array(517,"总和单双","总和单"),//總單
    1312=>array(517,"总和单双","总和双"),//總雙

    1313=>array(518,"龙虎和","龙"),//龙
    1314=>array(518,"龙虎和","虎"),//虎
    1315=>array(518,"龙虎和","和"),//和

    1316=>array(519,"前三","豹子"),//豹子
    1317=>array(519,"前三","顺子"),//顺子
    1318=>array(519,"前三","对子"),//对子
    1319=>array(519,"前三","半顺"),//半顺
    1320=>array(519,"前三","杂六"),//杂六

    1321=>array(520,"中三","豹子"),//豹子
    1322=>array(520,"中三","顺子"),//顺子
    1323=>array(520,"中三","对子"),//对子
    1324=>array(520,"中三","半顺"),//半顺
    1325=>array(520,"中三","杂六"),//杂六

    1326=>array(521,"后三","豹子"),//豹子
    1327=>array(521,"后三","顺子"),//顺子
    1328=>array(521,"后三","对子"),//对子
    1329=>array(521,"后三","半顺"),//半顺
    1330=>array(521,"后三","杂六"),//杂六
);

// 腾讯二分彩
$config['efcSSC_typecode']=array(
    1400=>array(609,"第一球"),
    1401=>array(610,"第二球"),
    1402=>array(611,"第三球"),
    1403=>array(612,"第四球"),
    1404=>array(613,"第五球"),

    1405=>array(614,"1-5大小","大"),//大
    1406=>array(614,"1-5大小","小 "),//小

    1407=>array(615,"1-5单双","单"),//单
    1408=>array(615,"1-5单双","双"),//双

    1409=>array(616,"总和大小","总和大"),//總大
    1410=>array(616,"总和大小","总和小"),//總小

    1411=>array(617,"总和单双","总和单"),//總單
    1412=>array(617,"总和单双","总和双"),//總雙

    1413=>array(618,"龙虎和","龙"),//龙
    1414=>array(618,"龙虎和","虎"),//虎
    1415=>array(618,"龙虎和","和"),//和

    1416=>array(619,"前三","豹子"),//豹子
    1417=>array(619,"前三","顺子"),//顺子
    1418=>array(619,"前三","对子"),//对子
    1419=>array(619,"前三","半顺"),//半顺
    1420=>array(619,"前三","杂六"),//杂六

    1421=>array(620,"中三","豹子"),//豹子
    1422=>array(620,"中三","顺子"),//顺子
    1423=>array(620,"中三","对子"),//对子
    1424=>array(620,"中三","半顺"),//半顺
    1425=>array(620,"中三","杂六"),//杂六

    1426=>array(621,"后三","豹子"),//豹子
    1427=>array(621,"后三","顺子"),//顺子
    1428=>array(621,"后三","对子"),//对子
    1429=>array(621,"后三","半顺"),//半顺
    1430=>array(621,"后三","杂六"),//杂六
);

// 快樂十分
$config ['ten_typecode'] = array (
    2001 => array (19,"第一球"),
    2002 => array (20,"第二球"),
    2003 => array (21,"第三球"),
    2004 => array (22,"第四球"),
    2005 => array (23,"第五球"),
    2006 => array (24,"第六球"),
    2007 => array (25,"第七球"),
    2008 => array (26,"第八球"),
    2009 => array (27,"1-8大小","大"), // 大
    2010 => array (27,"1-8大小","小"), // 小
    2011 => array (28,"1-8單雙","單"), // 單
    2012 => array (28,"1-8單雙","雙"), // 雙
    2013 => array (29,"1-8尾數大小","尾大"), // 尾大
    2014 => array (29,"1-8尾數大小","尾小"), // 尾小
    2015 => array (30,"1-8合數單雙","合數單"), // 合單
    2016 => array (30,"1-8合數單雙","合數雙"), // 合雙
    2017 => array (31,"1-8方位","東"), // 東
    2018 => array (31,"1-8方位","南"), // 南
    2019 => array (31,"1-8方位","西"), // 西
    2020 => array (31,"1-8方位","北"), // 北
    2021 => array (32,"1-8中發白","中"), // 中
    2022 => array (32,"1-8中發白","發"), // 發
    2023 => array (32,"1-8中發白","白"), // 白
    2024 => array (33,"總和大小","總和大"), // 總大
    2025 => array (33,"總和大小","總和小"), // 總小
    2026 => array (34,"總和單雙","總和單"), // 總單
    2027 => array (34,"總和單雙","總和雙"), // 總雙
    2028 => array (35,"總和尾數大小","總和尾大"), // 總尾大
    2029 => array (35,"總和尾數大小","總和尾小"), // 總尾小
    2030 => array (36,"龍虎","龍"), // 龍
    2031 => array (36,"龍虎","虎"), // 虎
    2032 => array (37,"任選二","任選二"),
    2033 => array (38,"選二連直","選二連直"),
    2034 => array (39,"選二連組","選二連組"),
    2035 => array (40,"任選三","任選三"),
    2036 => array (41,"選三前直","選三前直"),
    2037 => array (42,"選三前組","選三前組"),
    2038 => array (43,"任選四","任選四"),
    2039 => array (44,"任選五","任選五")
);

$config ['saiche_typecode'] = array (
    3001 => array (53,"冠軍"),
    3002 => array (54,"亞軍"),
    3003 => array (55,"第三名"),
    3004 => array (56,"第四名"),
    3005 => array (57,"第五名"),
    3006 => array (58,"第六名"),
    3007 => array (59,"第七名"),
    3008 => array (60,"第八名"),
    3009 => array (61,"第九名"),
    3010 => array (62,"第十名"),
    3011 => array (63,"1-10大小","大"),
    3012 => array (63,"1-10大小","小"),
    3013 => array (64,"1-10單雙","單"),
    3014 => array (64,"1-10單雙","雙"),
    3015 => array (65,"1-5龍虎","龍"),
    3016 => array (65,"1-5龍虎","虎"),
    3017 => array (66,"冠亞軍和大小","大"),
    3018 => array (66,"冠亞軍和大小","小"),
    3019 => array (67,"冠亞軍和單雙","單"),
    3020 => array (67,"冠亞軍和單雙","雙"),
    3021 => array (68,"冠亞軍和")
);

$config ['xyft_typecode'] = array (
    3101 => array (173,"冠軍"),
    3102 => array (174,"亞軍"),
    3103 => array (175,"第三名"),
    3104 => array (176,"第四名"),
    3105 => array (177,"第五名"),
    3106 => array (178,"第六名"),
    3107 => array (179,"第七名"),
    3108 => array (180,"第八名"),
    3109 => array (181,"第九名"),
    3110 => array (182,"第十名"),
    3111 => array (183,"1-10大小","大"),
    3112 => array (183,"1-10大小","小"),
    3113 => array (184,"1-10單雙","單"),
    3114 => array (184,"1-10單雙","雙"),
    3115 => array (185,"1-5龍虎","龍"),
    3116 => array (185,"1-5龍虎","虎"),
    3117 => array (186,"冠亞軍和大小","大"),
    3118 => array (186,"冠亞軍和大小","小"),
    3119 => array (187,"冠亞軍和單雙","單"),
    3120 => array (187,"冠亞軍和單雙","雙"),
    3121 => array (188,"冠亞軍和")
);

//极速飞艇
$config['jsft_typecode']=array(
    3301=>array(224,"冠军"),
    3302=>array(225,"亚军"),
    3303=>array(226,"第三名"),
    3304=>array(227,"第四名"),
    3305=>array(228,"第五名"),
    3306=>array(229,"第六名"),
    3307=>array(230,"第七名"),
    3308=>array(231,"第八名"),
    3309=>array(232,"第九名"),
    3310=>array(233,"第十名"),
    3311=>array(234,"1-10大小","大"),
    3312=>array(234,"1-10大小","小"),
    3313=>array(235,"1-10单双","单"),
    3314=>array(235,"1-10单双","双"),
    3315=>array(236,"1-5龙虎","龙"),
    3316=>array(236,"1-5龙虎","虎"),
    3317=>array(237,"冠亚军和","大"),
    3318=>array(237,"冠亚军和","小"),
    3319=>array(238,"冠亚军和","单"),
    3320=>array(238,"冠亚军和","双"),
    3321=>array(239,"冠亚军和")
);

$config ['jssaiche_typecode'] = array (
    3201 => array (191,"冠軍"),
    3202 => array (192,"亞軍"),
    3203 => array (193,"第三名"),
    3204 => array (194,"第四名"),
    3205 => array (195,"第五名"),
    3206 => array (196,"第六名"),
    3207 => array (197,"第七名"),
    3208 => array (198,"第八名"),
    3209 => array (199,"第九名"),
    3210 => array (200,"第十名"),
    3211 => array (201,"1-10大小","大"),
    3212 => array (201,"1-10大小","小"),
    3213 => array (202,"1-10單雙","單"),
    3214 => array (202,"1-10單雙","雙"),
    3215 => array (203,"1-5龍虎","龍"),
    3216 => array (203,"1-5龍虎","虎"),
    3217 => array (204,"冠亞軍和大小","大"),
    3218 => array (204,"冠亞軍和大小","小"),
    3219 => array (205,"冠亞軍和單雙","單"),
    3220 => array (205,"冠亞軍和單雙","雙"),
    3221 => array (206,"冠亞軍和")
);

// 香港六合彩
$config ['lottery_menu'] = array (
    1 => "特A",
    2 => "特B",
    3 => "正A",
    4 => "正B",
    5 => "正1特",
    6 => "正2特",
    7 => "正3特",
    8 => "正4特",
    9 => "正5特",
    10 => "正6特",
    11 => "正1-6",
    12 => "过关",
    13 => "连码",
    14 => "半波",
    15 => "生肖/尾数",
    16 => "特肖",
    17 => "二肖",
    18 => "三肖",
    19 => "四肖",
    20 => "五肖",
    21 => "六肖",
    22 => "七肖",
    23 => "八肖",
    24 => "九肖",
    25 => "十肖",
    26 => "十一肖",
    27 => "二肖连中",
    28 => "三肖连中",
    29 => "四肖连中",
    30 => "五肖连中",
    31 => "二肖连不中",
    32 => "三肖连不中",
    33 => "四肖连不中",
    34 => "二尾连中",
    35 => "三尾连中",
    36 => "四尾连中",
    37 => "二尾连不中",
    38 => "三尾连不中",
    39 => "四尾连不中",
    40 => "五不中",
    41 => "六不中",
    42 => "七不中",
    43 => "八不中",
    44 => "九不中",
    45 => "十不中",
    46 => "十一不中",
    47 => "十二不中"
);
//pc蛋蛋
$config['pcdd_typecode']=array(
    5001=>array(306,"特码零",0),
    5002=>array(307,"特码一",1),
    5003=>array(308,"特码二",2),
    5004=>array(309,"特码三",3),
    5005=>array(310,"特码四",4),
    5006=>array(311,"特码五",5),
    5007=>array(312,"特码六",6),
    5008=>array(313,"特码七",7),
    5009=>array(314,"特码八",8),
    5010=>array(315,"特码九",9),
    5011=>array(316,"特码十",10),
    5012=>array(317,"特码十一",11),
    5013=>array(318,"特码十二",12),
    5014=>array(319,"特码十三",13),
    5015=>array(320,"特码十四",14),
    5016=>array(321,"特码十五",15),
    5017=>array(322,"特码十六",16),
    5018=>array(323,"特码十七",17),
    5019=>array(324,"特码十八",18),
    5020=>array(325,"特码十九",19),
    5021=>array(326,"特码二十",20),
    5022=>array(327,"特码二一",21),
    5023=>array(328,"特码二二",22),
    5024=>array(329,"特码二三",23),
    5025=>array(330,"特码二四",24),
    5026=>array(331,"特码二五",25),
    5027=>array(332,"特码二六",26),
    5028=>array(333,"特码二七",27),

    5029=>array(334,"单双","单"),
    5030=>array(334,"单双","双"),
    5031=>array(335,"大小","大"),
    5032=>array(335,"大小","小"),
    5033=>array(336,"大单小单","大单"),
    5034=>array(336,"大单小单","小单"),
    5035=>array(337,"大双小双","大双"),
    5036=>array(337,"大双小双","小双"),
    5037=>array(338,"极大极小","极大"),
    5038=>array(338,"极大极小","极小"),
    5039=>array(339,"色波","红波"),
    5040=>array(339,"色波","绿波"),
    5041=>array(339,"色波","蓝波"),
    5042=>array(340,"豹子","豹子"),
    5043=>array(341,"特码包三")
);
//极速快3
$config['jsk3_typecode']=array(
    //猜必出
    2500=>array(386,"1"),
    2501=>array(386,"2"),
    2502=>array(386,"3"),
    2503=>array(386,"4"),
    2504=>array(386,"5"),
    2505=>array(386,"6"),

    //三同号
    2509=>array(389,"1、1、1"),
    2510=>array(389,"2、2、2"),
    2511=>array(389,"3、3、3"),
    2512=>array(389,"4、4、4"),
    2513=>array(389,"5、5、5"),
    2514=>array(389,"6、6、6"),

    //和值
    2611=>array(390,"3点"),
    2515=>array(390,"4点"),
    2516=>array(390,"5点"),
    2517=>array(390,"6点"),
    2518=>array(390,"7点"),
    2519=>array(390,"8点"),
    2520=>array(390,"9点"),
    2521=>array(390,"10点"),
    2522=>array(390,"11点"),
    2523=>array(390,"12点"),
    2524=>array(390,"13点"),
    2525=>array(390,"14点"),
    2526=>array(390,"15点"),
    2527=>array(390,"16点"),
    2528=>array(390,"17点"),
    2612=>array(390,"18点"),

    //二不同号
    2529=>array(391,"1、2"),
    2530=>array(391,"1、3"),
    2531=>array(391,"1、4"),
    2532=>array(391,"1、5"),
    2533=>array(391,"1、6"),
    2534=>array(391,"2、3"),
    2535=>array(391,"2、4"),
    2536=>array(391,"2、5"),
    2537=>array(391,"2、6"),
    2538=>array(391,"3、4"),
    2539=>array(391,"3、5"),
    2540=>array(391,"3、6"),
    2541=>array(391,"4、5"),
    2542=>array(391,"4、6"),
    2543=>array(391,"5、6"),

    //二同号复选
    2544=>array(392,"1、1"),
    2545=>array(392,"2、2"),
    2546=>array(392,"3、3"),
    2547=>array(392,"4、4"),
    2548=>array(392,"5、5"),
    2549=>array(392,"6、6"),

    //猜必不出
    2550=>array(393,"1"),
    2551=>array(393,"2"),
    2552=>array(393,"3"),
    2553=>array(393,"4"),
    2554=>array(393,"5"),
    2555=>array(393,"6"),

    //大小单双
    2506=>array(387,"大"),//大
    2507=>array(387,"小"),//小
    2556=>array(387,"单"),//单
    2557=>array(387,"双"),//双

    //通选
    2508=>array(388,"豹子"), // 通选豹子
    2558=>array(396,"顺子"),
    2559=>array(397,"对子"),
    2560=>array(398,"三不同"),

    //三不同
    2561=>array(394,"1、2、3"),
    2562=>array(394,"1、2、4"),
    2563=>array(394,"1、2、5"),
    2564=>array(394,"1、2、6"),
    2565=>array(394,"1、3、4"),
    2566=>array(394,"1、3、5"),
    2567=>array(394,"1、3、6"),
    2568=>array(394,"1、4、5"),
    2569=>array(394,"1、4、6"),
    2570=>array(394,"1、5、6"),
    2571=>array(394,"2、3、4"),
    2572=>array(394,"2、3、5"),
    2573=>array(394,"2、3、6"),
    2574=>array(394,"2、4、5"),
    2575=>array(394,"2、4、6"),
    2576=>array(394,"2、5、6"),
    2577=>array(394,"3、4、5"),
    2578=>array(394,"3、4、6"),
    2579=>array(394,"3、5、6"),
    2580=>array(394,"4、5、6"),

    //二同号单选
    2581=>array(395,"1、1、2"),
    2582=>array(395,"1、1、3"),
    2583=>array(395,"1、1、4"),
    2584=>array(395,"1、1、5"),
    2585=>array(395,"1、1、6"),
    2586=>array(395,"2、2、1"),
    2587=>array(395,"2、2、3"),
    2588=>array(395,"2、2、4"),
    2589=>array(395,"2、2、5"),
    2590=>array(395,"2、2、6"),
    2591=>array(395,"3、3、1"),
    2592=>array(395,"3、3、2"),
    2593=>array(395,"3、3、4"),
    2594=>array(395,"3、3、5"),
    2595=>array(395,"3、3、6"),
    2596=>array(395,"4、4、1"),
    2597=>array(395,"4、4、2"),
    2598=>array(395,"4、4、3"),
    2599=>array(395,"4、4、5"),
    2600=>array(395,"4、4、6"),
    2601=>array(395,"5、5、1"),
    2602=>array(395,"5、5、2"),
    2603=>array(395,"5、5、3"),
    2604=>array(395,"5、5、4"),
    2605=>array(395,"5、5、6"),
    2606=>array(395,"6、6、1"),
    2607=>array(395,"6、6、2"),
    2608=>array(395,"6、6、3"),
    2609=>array(395,"6、6、4"),
    2610=>array(395,"6、6、5"),
);

//--------------------------------------------------- 彩票 End

//-------------------------------------------------AG 游戏数据 Start
// 真人游戏
$agGames = array(
    'BAC'=>'百家乐',
    'CBAC'=>'包桌百家乐',
    'LINK'=>'连环百家乐',
    'DT'=>'龙虎',
    'SHB'=>'骰宝',
    'ROU'=>'轮盘',
    'FT'=>'番摊',
    'LBAC'=>'竞咪百家乐',
    'ULPK'=>'终极德州扑克',
    'SBAC'=>'保險百家樂',
    'NN'=>'牛牛',
    'BJ'=>'Blackjack',
    'ZJH'=>'炸金花',
    'SG'=>'三公',
);
// 电子游戏
$agDianziGames = array(
    'FRU'=>'水果拉霸',
    'SLM1'=>'美女沙排',
    'SLM2'=>'运财羊',
    'SLM3'=>'武圣传',
    'TGLW'=>'极速幸运轮',
    'PKBJ'=>'杰克高手(大版视频扑克)',
    'SB01'=>'太空漫游',
    'SB02'=>'复古花园',
    'SB03'=>'关东煮',
    'SB04'=>'牧场咖啡',
    'SB05'=>'甜一甜屋',
    'SB06'=>'日本武士',
    'SB07'=>'象棋老虎机',
    'SB08'=>'麻将老虎机',
    'SB09'=>'西洋棋老虎机',
    'SB10'=>'开心农场',
    'SB11'=>'夏日营地',
    'SB12'=>'海底漫游',
    'SB13'=>'鬼马小丑',
    'SB14'=>'机动乐园',
    'SB15'=>'惊吓鬼屋',
    'SB16'=>'疯狂马戏团',
    'SB17'=>'海洋剧场',
    'SB18'=>'水上乐园',
    'SB19'=>'空中战争',
    'SB20'=>'摇滚狂迷',
    'SB21'=>'越野机车',
    'SB22'=>'埃及奥秘',
    'SB23'=>'欢乐时光',
    'SB24'=>'侏罗纪',
    'SB25'=>'土地神',
    'SB26'=>'布袋和尚',
    'SB27'=>'正财神',
    'SB28'=>'武财神',
    'SB29'=>'偏财神',
    'AV01'=>'性感女仆',
    'SB30'=>'灵猴献瑞',
    'PKBD'=>'百搭二王',
    'PKBB'=>'红利百搭',
    'SB31'=>'天空守护者',
    'SB32'=>'齐天大圣',
    'SB33'=>'糖果碰碰乐',
    'SB34'=>'冰河世界',
    'FRU2'=>'水果拉霸2',
    'SB35'=>'欧洲列强争霸',
    'SB36'=>'捕鱼王者',
    'SB37'=>'上海百乐门',
    'SB38'=>'竞技狂热',
    'SB45'=>'猛龙传奇',
    'SB47'=>'神奇宝石',
    'SB49'=>'金龙珠',
    'SB50'=>'XIN哥来了',
    'SB51'=>'王者传说',
    'SB55'=>'多宝鱼虾蟹',
    'SB57'=>'魔龙',
    'SB58'=>'魅惑魔女',
    'XG01'=>'龙珠',
    'XG02'=>'幸运8',
    'XG03'=>'闪亮女郎',
    'XG04'=>'金鱼',
    'XG05'=>'中国新年',
    'XG06'=>'海盗王',
    'XG07'=>'鲜果狂热',
    'XG08'=>'小熊猫',
    'XG09'=>'大豪客',
    'XG10'=>'龙舟竞渡',
    'XG11'=>'中秋佳节',
    'XG12'=>'韩风劲舞',
    'XG13'=>'美女大格斗',
    'XG16'=>'黄金对垒',
    'SX02'=>'街头烈战',
    '800'=>'巨奖厅',
    'SC03'=>'金拉霸',
    'SC05'=>'百搭777',
    'EP02'=>'龙虎',
    'EP03'=>'骰宝',
    'SB56'=>'赌城之夜',
    'WA01'=>'钻石女王',
    'WC01'=>'跳跳乐',
    'WH01'=>'阿里巴巴',
    'WH02'=>'圣女贞德',
    'WH03'=>'冠军足球',
    'WH04'=>'穆夏女神',
    'WH06'=>'亚瑟王',
    'WH07'=>'五狮进宝',
    'WH10'=>'爱丽丝大冒险',
    'WH11'=>'战火风云',
    'WH12'=>'发财熊猫',
    'WH17'=>'嫦娥奔月',
    'WH18'=>'白雪公主',
    'WH19'=>'财宝塔罗',
    'WH20'=>'葫芦兄弟',
    'WH21'=>'永恒之吻',
    'WH22'=>'恐怖嘉年华',
    'WH23'=>'封神演义',
    'WH24'=>'僵尸来袭',
    'WH26'=>'寿司大食客',
    'WH27'=>'和风剧院',
    'WH28'=>'埃及宝藏',
    'WH29'=>'狂野女巫',
    'WH30'=>'点石成金',
    'WH32'=>'贪玩蓝月',
    'WH34'=>'内衣橄榄球',
    'WH35'=>'招财锦鲤',
    'WH36'=>'横行霸道',
    'WH38'=>'十二生肖',
    'WH40'=>'皇家戏台',
    'WH42'=>'古惑仔',
    'WH44'=>'蒸汽战争',
    'WH54'=>'极品飙车',
    'WH55'=>'神奇宠物',
    'WC02'=>'疯狂弹球',
);
//-------------------------------------------------AG 游戏数据 End

// -----------------------------------------------------AG 玩法数据 Start 20180530
// 百家乐
$playType['baijiale'] = array(
    1=>'庄',
    2=>'闲',
    3=>'和',
    4=>'庄对',
    5=>'闲对',
    6=>'大',
    7=>'小',
    8=>'莊保險',
    9=>'閑保險',
    11=>'庄免佣',
    12=>'庄龙宝',
    13=>'闲龙宝',
    14=>'超级六',
    15=>'任意对子',
    16=>'完美对子',
    17=>'庄例牌',
    18=>'闲例牌',
    30=>'超和0',
    31=>'超和1',
    32=>'超和2',
    33=>'超和3',
    34=>'超和4',
    35=>'超和5',
    36=>'超和6',
    37=>'超和7',
    38=>'超和8',
    39=>'超和9',
);
// 龙虎
$playType['longhu'] = array(
    21=>'龙',
    22=>'虎',
    23=>'和（龙虎）',
    130=>'龙单',
    131=>'虎单',
    132=>'龙双',
    133=>'虎双',
    134=>'龙红',
    135=>'虎红',
    136=>'龙黑',
    137=>'虎黑',
);
// 骰宝玩法
$playType['toubao'] = array(
    41=>'大',
    42=>'小',
    43=>'单',
    44=>'双',
    45=>'全围',
    46=>'围1',
    47=>'围2',
    48=>'围3',
    49=>'围4',
    50=>'围5',
    51=>'围6',
    52=>'单点1',
    53=>'单点2',
    54=>'单点3',
    55=>'单点4',
    56=>'单点5',
    57=>'单点6',
    58=>'对子1',
    59=>'对子2',
    60=>'对子3',
    61=>'对子4',
    62=>'对子5',
    63=>'对子6',
    64=>'组合12',
    65=>'组合13',
    66=>'组合14',
    67=>'组合15',
    68=>'组合16',
    69=>'组合23',
    70=>'组合24',
    71=>'组合25',
    72=>'组合26',
    73=>'组合34',
    74=>'组合35',
    75=>'组合36',
    76=>'组合45',
    77=>'组合46',
    78=>'组合56',
    79=>'和值4',
    80=>'和值5',
    81=>'和值6',
    82=>'和值7',
    83=>'和值8',
    84=>'和值9',
    85=>'和值10',
    86=>'和值11',
    87=>'和值12',
    88=>'和值13',
    89=>'和值14',
    90=>'和值15',
    91=>'和值16',
    92=>'和值17',
);
// 轮盘玩法
$playType['lunpan'] = array(
    101=>'直接注',
    102=>'分注',
    103=>'街注',
    104=>'三數',
    105=>'4個號碼',
    106=>'角注',
    107=>'列注(列1)',
    108=>'列注(列2)',
    109=>'列注(列3)',
    110=>'線注',
    111=>'打一',
    112=>'打二',
    113=>'打三',
    114=>'紅',
    115=>'黑',
    116=>'大',
    117=>'小',
    118=>'單',
    119=>'雙',
);
// 终极德州扑克玩法
$playType['dezhou'] = array(
    180=>'底注+盲注',
    181=>'一倍加注',
    182=>'二倍加注',
    183=>'三倍加注',
    184=>'四倍加注',
);
// 牛牛玩法
$playType['niuniu'] = array(
    207=>'莊1平倍',
    208=>'莊1翻倍',
    209=>'莊2平倍',
    210=>'莊2翻倍',
    211=>'閑1平倍',
    212=>'閒1翻倍',
    213=>'閒2平倍',
    214=>'閒2翻倍',
    215=>'閒3平倍',
    216=>'閒3翻倍',
    217=>'莊3平倍',
    218=>'莊3翻倍',
);
// Blackjack 玩法
$playType['Blackjack'] = array(
    220=>'底注',
    221=>'分牌',
    222=>'保險',
    223=>'分牌保險',
    224=>'加注',
    225=>'分牌加注',
    226=>'完美對子',
    227=>'21+3',
    228=>'旁注',
    229=>'旁注分牌',
    230=>'旁注保險',
    231=>'旁注分牌保險',
    232=>'旁注加注',
);
// 炸金花玩法
$playType['zhajinhua'] = array(
    260=>'龍',
    261=>'鳳',
    262=>'對8以上',
    263=>'同花',
    264=>'順子',
    265=>'豹子',
    266=>'同花順',
);
//三公
$playType['sangong'] = array(
    320=>'庄赢闲1',
    321=>'闲1赢',
    322=>'闲1和',
    323=>'庄赢闲2',
    324=>'闲2赢',
    325=>'闲2和',
    326=>'庄赢闲3',
    327=>'闲3赢',
    328=>'闲3和',
    329=>'庄对牌以上',
    330=>'闲1对牌以上',
    331=>'闲1三公',
    332=>'闲2对牌以上',
    333=>'闲2三公',
    334=>'闲3对牌以上',
    335=>'闲3三公',
);
// -----------------------------------------------------AG 玩法数据 End

// ---------------------------------------------------- 真人视讯（ag、og、bbin）月月领俸禄等级数据 Start
// 晋升标准等级	有效投注	晋级礼金	月俸禄
$zhenrenLevelSalaryInfo = array(
    1=>array(
        'level'=>'1级',
        'valid_bet'=>'20万',
        'jinji_salary'=>'30',
        'month_salary'=>'9'),
    2=>array(
        'level'=>'2级',
        'valid_bet'=>'50万',
        'jinji_salary'=>'70',
        'month_salary'=>'20'),
    3=>array(
        'level'=>'3级',
        'valid_bet'=>'100万',
        'jinji_salary'=>'100',
        'month_salary'=>'40'),
    4=>array(
        'level'=>'4级',
        'valid_bet'=>'200万',
        'jinji_salary'=>'200',
        'month_salary'=>'70'),
    5=>array(
        'level'=>'5级',
        'valid_bet'=>'300万',
        'jinji_salary'=>'300',
        'month_salary'=>'100'),
    6=>array(
        'level'=>'6级',
        'valid_bet'=>'500万',
        'jinji_salary'=>'400',
        'month_salary'=>'150'),
    7=>array(
        'level'=>'7级',
        'valid_bet'=>'700万',
        'jinji_salary'=>'500',
        'month_salary'=>'200'),
    8=>array(
        'level'=>'8级',
        'valid_bet'=>'1000万',
        'jinji_salary'=>'700',
        'month_salary'=>'250'),
    9=>array(
        'level'=>'9级',
        'valid_bet'=>'1300万',
        'jinji_salary'=>'900',
        'month_salary'=>'300'),
    10=>array(
        'level'=>'10级',
        'valid_bet'=>'1600万',
        'jinji_salary'=>'1200',
        'month_salary'=>'400'),
    11=>array(
        'level'=>'11级',
        'valid_bet'=>'2000万',
        'jinji_salary'=>'1500',
        'month_salary'=>'500'),
    12=>array(
        'level'=>'12级',
        'valid_bet'=>'2500万',
        'jinji_salary'=>'1800',
        'month_salary'=>'700'),
    13=>array(
        'level'=>'13级',
        'valid_bet'=>'3000万',
        'jinji_salary'=>'2100',
        'month_salary'=>'900'),
    14=>array(
        'level'=>'14级',
        'valid_bet'=>'3500万',
        'jinji_salary'=>'2500',
        'month_salary'=>'1100'),
    15=>array(
        'level'=>'15级',
        'valid_bet'=>'4000万',
        'jinji_salary'=>'3000',
        'month_salary'=>'1300'),
    16=>array(
        'level'=>'16级',
        'valid_bet'=>'5000万',
        'jinji_salary'=>'4000',
        'month_salary'=>'1500'),
    17=>array(
        'level'=>'17级',
        'valid_bet'=>'6000万',
        'jinji_salary'=>'5000',
        'month_salary'=>'1800'),
    18=>array(
        'level'=>'18级',
        'valid_bet'=>'8000万',
        'jinji_salary'=>'6000',
        'month_salary'=>'2200'),
    19=>array(
        'level'=>'19级',
        'valid_bet'=>'1.0亿',
        'jinji_salary'=>'8000',
        'month_salary'=>'2600'),
    20=>array(
        'level'=>'20级',
        'valid_bet'=>'1.2亿',
        'jinji_salary'=>'10000',
        'month_salary'=>'3000'),
    21=>array(
        'level'=>'21级',
        'valid_bet'=>'1.5亿',
        'jinji_salary'=>'15000',
        'month_salary'=>'3500'),
    22=>array(
        'level'=>'22级',
        'valid_bet'=>'2.0亿',
        'jinji_salary'=>'20000',
        'month_salary'=>'4000'),
    23=>array(
        'level'=>'23级',
        'valid_bet'=>'2.5亿',
        'jinji_salary'=>'25000',
        'month_salary'=>'4500'),
    24=>array(
        'level'=>'24级',
        'valid_bet'=>'3.0亿',
        'jinji_salary'=>'30000',
        'month_salary'=>'5000'),
    25=>array(
        'level'=>'25级',
        'valid_bet'=>'4.0亿',
        'jinji_salary'=>'40000',
        'month_salary'=>'6000'),
    26=>array(
        'level'=>'26级',
        'valid_bet'=>'5.0亿',
        'jinji_salary'=>'50000',
        'month_salary'=>'7000'),
    27=>array(
        'level'=>'27级',
        'valid_bet'=>'7.0亿',
        'jinji_salary'=>'70000',
        'month_salary'=>'10000'),
    28=>array(
        'level'=>'28级',
        'valid_bet'=>'9.5亿',
        'jinji_salary'=>'100000',
        'month_salary'=>'20000'),
    29=>array(
        'level'=>'29级',
        'valid_bet'=>'12亿',
        'jinji_salary'=>'150000',
        'month_salary'=>'50000'),
    30=>array(
        'level'=>'30级',
        'valid_bet'=>'15亿',
        'jinji_salary'=>'200000',
        'month_salary'=>'80000'),
);
// ---------------------------------------------------- 真人视讯（ag、og、bbin）月月领俸禄等级数据 End

require_once("commonConfig.php");
require_once("max_bet_config.php");
require_once("hg_game_type.php");
require_once("app_config.php");
require_once("third_cp_config.php");
require_once("og/config.php");
require_once("mw/config.php");
require_once("fg/config.php");
