<?php


$lotteries_name= [
    'gc' => [
        1=>'欢乐生肖',
        2=>'山东11选5',
        3=>'黑龙江时时彩',
        4=>'上海时时乐',
        5=>'江西时时彩',
        6=>'新疆时时彩',
        7=>'天津时时彩',
        8=>'江西11选5',
        9=>'广东11选5',
        10=>'北京PK拾',
        11=>'3D',
        12=>'排列三/五',
        13=>'分分彩',
        14=>'11选5',
        15=>'江苏快三',
        16=>'三分彩',
        17=>'快三分分彩',
        18=>'甘肃快三',
        19=>'极速赛车',
        20=>'极速3D',
        21=>'广西快三',
        22=>'北京11选5',
        23=>'甘肃11选5',
        24=>'安徽11选5',
        25=>'辽宁11选5',
        26=>'秒秒彩',
        27=>'福建11选5',
        28=>'五分彩',
        29=>'贵州11选5',
        30=>'安徽快三',
        31=>'竞彩足球',
        32=>'山西11选5',
        33=>'河北快三',
        34=>'内蒙古11选5',
        35=>'吉林快三',
        36=>'云南时时彩',
        37=>'北京快乐8',
        38=>'韩国快乐彩',
        39=>'四川快乐十二',
        40=>'山西快乐十分',
        41=>'重庆快乐十分',
        42=>'浙江快乐十二',
        43=>'11选5秒秒彩',
        44=>'11选5三分彩',
        45=>'Bjklssc',
        46=>'韩国1.5分彩',
        49=>'幸运飞艇',
        51=>'三分快三',
        50=>'五分快三',
        52=>'北京赛车',
        53=>'重庆时时彩',
    ],
    'ssc' => [
        1=>'欢乐生肖',
        2=>'分分彩',
        3=>'腾讯分分彩',
        4=>'阿里二分彩',
        5=>'三分彩',
        6=>'五分彩',
        7=>'重庆时时彩',
        10=>'江苏骰宝(快3)',
        21=>'广东11选5',
        50=>'北京PK拾',
        51=>'极速赛车',
        55=>'幸运飞艇',
        60=>'广东快乐十分',
        61=>'重庆幸运农场',
        65=>'北京快乐8',
        66=>'PC蛋蛋',
        72=>'极速六合彩',
        73=>'五分快三',
        70=>'香港六合彩',
        74=>'三分快三',
        75=>'一分快三',
        76=>'五分北京赛车',
    ]
];

$terminals = [
    1 => 'WEB',
    2 => 'Android',
    3 => 'CRM',
    4 => 'WAP',
    5 => 'IOS',
    6 => 'CHAT',
];

// 中奖状态
$status = [
    0 => '正常',
    1 => '已撤销',
    2 => '未中奖',
    3 => '已中奖',
    4 => '已派奖',
    5 => '系统撤销',
];

// 模式
$coefficients = [
    '1.000' => '2元',
    '0.500' => '1元',
    '0.100' => '2角',
    '0.050' => '1角',
    '0.010' => '2分',
    '0.001' => '2厘'
];

?>