package com.hgapp.m8.data;

import java.util.List;

public class GetBankCardListResult {

    /**
     * status : 200
     * describe : success
     * timestamp : 20180806050647
     * data : ["中国工商银行","中国建设银行","中国农业银行","中国银行","交通银行","招商银行","中国民生银行","邮政储蓄银行","中信银行","光大银行","浦发银行","兴业银行","华夏银行","广发银行","平安银行","上海银行","江苏银行","安徽省农村信用社联合社","鞍山市商业银行","包商银行股份有限公司","北京农村商业银行","北京顺义银座村镇银行","北京银行","渤海银行","沧州银行","长安银行","长沙银行","常熟农村商业银行","成都银行","承德银行","重庆农村商业银行","重庆黔江银座村镇银行","重庆银行股份有限公司","重庆渝北银座村镇银行","大连银行","德阳银行","德州银行","东莞农村商业银行","东莞银行","东亚银行（中国）有限公司","东营莱商村镇银行股份有限公司","东营银行","鄂尔多斯银行","福建海峡银行","福建省农村信用社","阜新银行结算中心","富滇银行","赣州银行","广东华兴银行","广东南粤银行股份有限公司","广东省农村信用社联合社","广发银行股份有限公司","广西北部湾银行","广西农村信用社","广州农村商业银行","广州银行","贵阳银行","桂林银行股份有限公司","哈尔滨银行结算中心","海口联合农村商业银行","海南省农村信用社","邯郸市商业银行","韩亚银行","汉口银行","杭州银行","河北银行股份有限公司","恒丰银行","衡水银行","湖北农信","湖北银行","湖州银行","葫芦岛银行","华夏银行","黄河农村商业银行","徽商银行","交通银行","吉林农村信用社","吉林银行","济宁银行","嘉兴银行清算中心","江苏长江商行","江苏省农村信用社联合社","江苏银行股份有限公司","江西赣州银座村镇银行","江阴农商银行","锦州银行","晋城银行","晋商银行网上银行","九江银行股份有限公司","昆仑银行","昆山农村商业银行","莱商银行","兰州银行股份有限公司","廊坊银行","临商银行","柳州银行","龙江银行","洛阳银行","漯河市商业银行","绵阳市商业银行","南昌银行","南充市商业银行","南京银行","内蒙古银行","宁波通商银行股份有限公司","宁波银行","宁夏银行","攀枝花市商业银行","平安银行（原深圳发展银行）","平顶山银行","齐鲁银行","齐商银行","企业银行","青岛银行","青海银行","泉州银行","日照银行","山东省农联社","上海农商银行","上海浦东发展银行","上海银行","上饶银行","绍兴银行","深圳福田银座村镇银行","深圳农商行","深圳前海微众银行","盛京银行","顺德农村商业银行","四川省联社","苏州银行","厦门国际银行","厦门银行","台州银行","太仓农商行","泰安市商业银行","天津滨海农村商业银行股份有限公司","天津农商银行","天津银行","威海市商业银行","潍坊银行","温州银行","乌鲁木齐市商业银行","吴江农村商业银行","武汉农村商业银行","西安银行","新韩银行中国","兴业银行","邢台银行","烟台银行","鄞州银行","营口银行","友利银行","云南省农村信用社","枣庄银行","张家港农村商业银行","张家口银行股份有限公司","浙江稠州商业银行","浙江景宁银座村镇银行","浙江民泰商业银行","浙江三门银座村镇银行","浙江省农村信用社","浙江泰隆商业银行","浙商银行","郑州银行","中原银行","珠海华润银行清算中心","自贡市商业银行清算中心"]
     * sign : 9bc1ca1802583cfe37ce7840774fb6e4
     */

    private int status;
    private String describe;
    private String timestamp;
    private String sign;
    private List<String> data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getDescribe() {
        return describe;
    }

    public void setDescribe(String describe) {
        this.describe = describe;
    }

    public String getTimestamp() {
        return timestamp;
    }

    public void setTimestamp(String timestamp) {
        this.timestamp = timestamp;
    }

    public String getSign() {
        return sign;
    }

    public void setSign(String sign) {
        this.sign = sign;
    }

    public List<String> getData() {
        return data;
    }

    public void setData(List<String> data) {
        this.data = data;
    }
}
